yblpoi/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 当前产品/固件基线使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 固定 8MB 镜像头，关闭 detect，便于 idf.py merge-bin。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=n
# 默认模板只保留 NVS、PHY data 和占用剩余空间的 factory app；用户可按需修改。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
# 界面大数字用的是像素字体 love_font_36(main/love_app.c),Montserrat 只用于
# 纯 ASCII 的 demo 页与像素字体的 fallback,所以只开 14/20 两档。
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# demo UI 简单,24KB 够用;恋爱倒计时的页面对象更多(底纹+图标+多人卡片),
# 调到 32KB 留出余量,避免绘制时池耗尽。
CONFIG_LV_MEM_SIZE_KILOBYTES=32

# --- 系统 ---
CONFIG_FREERTOS_HZ=1000

# --- 编译器 ---
# 按体积优化(-Os)。ESP-IDF 默认按调试优化(-Og),会让 app 镜像明显偏大;
# 本项目的瓶颈在 SPI 刷屏与 I2S DMA,不在 CPU,所以 -Os 不会影响观感与时序。
# 断言级别保持默认(ENABLE),不要改成 DISABLE —— 那会把 assert() 变成空操作。
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# --- SNTP ---
# 设备没有 RTC，时间只能靠网络拿回来，所以配两个服务器做容错。
# 该选项同时决定 esp_sntp_config_t.servers[] 的长度：保持 1 会让第二个
# 服务器在编译期被静默丢弃（excess elements in array initializer）。
CONFIG_LWIP_SNTP_MAX_SERVERS=2

# --- Bluetooth LE / NimBLE ---
# ESP32-C3 仅支持 BLE；示例只启用单连接 peripheral 所需的最小 host 配置。
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_HOST_BASED_PRIVACY=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
